app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods"
---
  def index
    @food = Food.all

INSERT INTO "foods" ("name", "measurement_unit", "price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Pineapple"], ["measurement_unit", "gram"], ["price", "20.0"], ["created_at", "2022-03-15 20:18:54.953474"], ["updated_at", "2022-03-15 20:18:54.953474"], ["user_id", 2]]
---
  def create
    @food = current_user.foods.create!(
      name: params[:food][:name],
      measurement_unit: params[:food][:measurement_unit],
      price: params[:food][:price]
    )

DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 2]]
---
  def destroy
    @food.destroy